[
  {
    "id": "creative_0",
    "category": "Creative Problem Solving",
    "problem": "Design a system to help elderly people remember to take their medications without using smartphones or complex technology."
  },
  {
    "id": "creative_1",
    "category": "Creative Problem Solving",
    "problem": "Create a method to determine if a watermelon is ripe without cutting it open or tapping it."
  },
  {
    "id": "creative_2",
    "category": "Creative Problem Solving",
    "problem": "Develop a way to cross a 20-meter wide river with only two 10-meter planks of wood."
  },
  {
    "id": "creative_3",
    "category": "Creative Problem Solving",
    "problem": "Propose a solution for reducing food waste in school cafeterias by at least 50%."
  },
  {
    "id": "creative_4",
    "category": "Creative Problem Solving",
    "problem": "Design a system to collect rainwater in a desert community with minimal infrastructure."
  },
  {
    "id": "creative_5",
    "category": "Creative Problem Solving",
    "problem": "Create a method to fairly divide a cake among 7 people when each person values different parts of the cake differently."
  },
  {
    "id": "creative_6",
    "category": "Creative Problem Solving",
    "problem": "Develop a non-electronic communication system that could work over a distance of 5 kilometers."
  },
  {
    "id": "creative_7",
    "category": "Creative Problem Solving",
    "problem": "Design a way to transport a raw egg safely from the roof of a 10-story building to the ground without using conventional packaging materials."
  },
  {
    "id": "creative_8",
    "category": "Creative Problem Solving",
    "problem": "Create a solution to prevent ice cream from melting quickly on hot days without using refrigeration or insulation."
  },
  {
    "id": "creative_9",
    "category": "Creative Problem Solving",
    "problem": "Develop a method to determine the height of a tall building using only a barometer, without measuring air pressure."
  },
  {
    "id": "creative_10",
    "category": "Creative Problem Solving",
    "problem": "Design a traffic system for a busy intersection that doesn't use traffic lights, stop signs, or roundabouts."
  },
  {
    "id": "creative_11",
    "category": "Creative Problem Solving",
    "problem": "Create a way to identify counterfeit currency without using specialized equipment or technology."
  },
  {
    "id": "creative_12",
    "category": "Creative Problem Solving",
    "problem": "Develop a method to sort a large pile of mixed recycling (plastic, paper, metal) efficiently without modern sorting machines."
  },
  {
    "id": "creative_13",
    "category": "Creative Problem Solving",
    "problem": "Design a system to reduce water usage in home showers by 40% without reducing shower time or water pressure."
  },
  {
    "id": "creative_14",
    "category": "Creative Problem Solving",
    "problem": "Create a solution for urban noise pollution that doesn't involve soundproofing buildings or restricting activities."
  },
  {
    "id": "creative_15",
    "category": "Creative Problem Solving",
    "problem": "Develop a method to keep track of time accurately without using clocks, watches, or electronic devices."
  },
  {
    "id": "creative_16",
    "category": "Creative Problem Solving",
    "problem": "Design a way to cook a meal during a power outage without using gas, fire, or battery-powered devices."
  },
  {
    "id": "creative_17",
    "category": "Creative Problem Solving",
    "problem": "Create a system to help people find their parked car in a large parking lot without using GPS or smartphone technology."
  },
  {
    "id": "creative_18",
    "category": "Creative Problem Solving",
    "problem": "Develop a method to prevent shoplifting in a retail store without using security cameras or electronic tags."
  },
  {
    "id": "creative_19",
    "category": "Creative Problem Solving",
    "problem": "Design a non-digital solution to help people who speak different languages communicate effectively in emergency situations."
  },
  {
    "id": "creative_20",
    "category": "Creative Problem Solving",
    "problem": "Create a way to discourage people from using their phones during social gatherings without confiscating the devices."
  },
  {
    "id": "creative_21",
    "category": "Creative Problem Solving",
    "problem": "Develop a method to transport water uphill without using electricity, motors, or pumps."
  },
  {
    "id": "creative_22",
    "category": "Creative Problem Solving",
    "problem": "Design a system to encourage children to do their household chores willingly without offering monetary rewards."
  },
  {
    "id": "creative_23",
    "category": "Creative Problem Solving",
    "problem": "Create a solution to reduce the amount of plastic packaging waste generated by grocery shopping."
  },
  {
    "id": "creative_24",
    "category": "Creative Problem Solving",
    "problem": "Develop a way to keep your place in a book without using bookmarks, dog-earing pages, or electronic devices."
  },
  {
    "id": "creative_25",
    "category": "Creative Problem Solving",
    "problem": "Design a method to teach mathematics to visual learners who struggle with traditional numerical approaches."
  },
  {
    "id": "creative_26",
    "category": "Creative Problem Solving",
    "problem": "Create a system to reduce traffic congestion during rush hour without building new roads or implementing public transportation."
  },
  {
    "id": "creative_27",
    "category": "Creative Problem Solving",
    "problem": "Develop a way to organize a community event that includes people of all ages, abilities, and backgrounds so everyone feels equally included."
  },
  {
    "id": "creative_28",
    "category": "Creative Problem Solving",
    "problem": "Design a solution to prevent bicycle theft in urban areas without using locks, chains, or electronic tracking devices."
  },
  {
    "id": "creative_29",
    "category": "Creative Problem Solving",
    "problem": "Create a method to keep your home cool during summer heat waves without using air conditioning or electric fans."
  }
]